ExchangePlans/ОбменССайтом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<ExchangePlan>
		<Properties>
			<Name>ОбменССайтом</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АдресСайта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецКаталога</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьИзменения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьКартинки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьНаСайт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьОстаткиПоСкладам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыполнятьПолнуюВыгрузкуПринудительно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДляНовойНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаДляНовыхКонтрагентов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаВыгрузкиЗаказов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторРегламентногоЗадания</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьРегламентноеЗадание</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогВыгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПовторений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтрагентДляПодстановкиВЗаказы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиПоискаКонтрагентов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбменЗаказами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбменТоварами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбновлятьТолькоНеПроведенныеЗаказыПриЗагрузке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОрганизацияДляПодстановкиВЗаказы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборГруппыКатегорииНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОтборовНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазмерПорции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегистрироватьИзменения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимВыгрузкиЦен</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РекламныйИсточник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РекламныеИсточники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладДляПодстановкиВЗаказы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохраненнаяТаблицаКаталогов</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособИдентификацииКонтрагентов</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыИдентификацииКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусЗаказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатусыЗаказовПокупателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТолькоСоздаватьНовыеЗаказы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ВестиЛогированиеОбмена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ЛогСобытийОтключитьПосле</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ОбрезатьИсториюОбменов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УДАЛИТЬ_ЧислоДнейХраненияИстории</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлЗагрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СоответствиеСтатусовЗаказов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИДСтатусаЗаказаНаСайте</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусЗаказаНаСайте</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусЗаказаПокупателя</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатусыЗаказовПокупателей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РезервироватьТовар</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкладРезерв</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыЦен</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидЦен</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СтруктураКаталога</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Группа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</ExchangePlan>
</MetaDataObject>

InformationRegisters/ОбменССайтомСтруктураКаталога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ОбменССайтомСтруктураКаталога</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РодительГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РодительКатегория</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоГруппа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УзелОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторКаталога</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаКаталога</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РодительИдентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыОтборовНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыОтборовНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ГруппыНоменклатуры</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КатегорииНоменклатуры</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ExchangePlans/ОбменССайтом/Forms/НастройкаСтруктурыКаталога/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УзелОбмена = Параметры.Ключ;
	ОтборКатегорииИерархия = Параметры.ОтборГруппыКатегорииНоменклатуры;
	Если Параметры.ОтборГруппыКатегорииНоменклатуры = Перечисления.ВидыОтборовНоменклатуры.КатегорииНоменклатуры Тогда
		ЗаполнитьДеревоКатегорий(Параметры.ТаблицаКаталоговГруппы);
		Элементы.СтраницыКатегорииИерархия.ТекущаяСтраница = Элементы.КатегорииОтбор;
	Иначе
		ЗаполнитьДеревоИерархии(Параметры.ТаблицаКаталоговГруппы);
		Элементы.СтраницыКатегорииИерархия.ТекущаяСтраница = Элементы.ИерархияГруппыОтбор;
	КонецЕсли;
	ДетализацияОтбора = Параметры.РучнаяНастройкаКаталога;
	Если ДетализацияОтбора = 0 Тогда
		ДетализацияОтбора = 1;
	Иначе
		ЗаполнитьДеревоИзСохраненныхДанных(Параметры.ИдентификаторКаталога, Параметры.АдресНастроекСтруктурыКаталога);	
	КонецЕсли;
	
	Номенклатура.Параметры.УстановитьЗначениеПараметра("Выбранные", Неопределено);
	Элементы.НоменклатураОтбор.Доступность = (ДетализацияОтбора = 1);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОтборИерархияПриАктивизацииСтроки(Элемент)
	
	Если Элементы.ОтборИерархия.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НовоеЗначение = Элементы.ОтборИерархия.ТекущиеДанные.Значение;
	НовоеПредставление = Элементы.ОтборИерархия.ТекущиеДанные.Представление;
	
	Для каждого элОтбора Из ЭтотОбъект.Номенклатура.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы Цикл
		Если Строка(элОтбора.ЛевоеЗначение) = "Родитель" Тогда
			
			Если элОтбора.ПравоеЗначение = НовоеЗначение И элОтбора.Представление = НовоеПредставление И элОтбора.Использование Тогда
				Возврат;
			Иначе
				УстановитьОтборПоИерархии();
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	//отбор не был установлен ранее, и текущее значение отбора = <Все группы>
	Если НЕ Элементы.ОтборИерархия.ТекущиеДанные.Представление = "<Все группы>" Тогда
		УстановитьОтборПоИерархии();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборКатегорииПриАктивизацииСтроки(Элемент)

	Если ОтборКатегорииИерархия <> ПредопределенноеЗначение("Перечисление.ВидыОтборовНоменклатуры.КатегорииНоменклатуры") Тогда
		Возврат;
	КонецЕсли;
	
	Если Элементы.ОтборКатегории.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ОтборКатегорииТекущая = Элементы.ОтборКатегории.ТекущиеДанные.Значение Тогда
		Возврат;
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ОтборКатегорииПриАктивизацииСтрокиНаКлиенте", 0.2, Истина);
	
	ТекущийЭлемент = Элементы.ОтборКатегории;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьОтборПоИерархии()
	
	Если Элементы.ОтборИерархия.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоОтборПоГруппе = ЗначениеЗаполнено(Элементы.ОтборИерархия.ТекущиеДанные.Значение);
	
	ПравоеЗначение	= Неопределено;
	Сравнение		= ВидСравненияКомпоновкиДанных.Равно;
	Использование	= Истина;
	Представление	= Элементы.ОтборИерархия.ТекущиеДанные.Представление;
	
	Если ЭтоОтборПоГруппе Тогда
		
		Если Элементы.ОтборИерархияКонтекстноеМенюИерархияВключаяВложенные.Пометка Тогда
			Сравнение = ВидСравненияКомпоновкиДанных.ВИерархии;
		КонецЕсли;
		ПравоеЗначение = Элементы.ОтборИерархия.ТекущиеДанные.Значение;
		
	ИначеЕсли Элементы.ОтборИерархия.ТекущиеДанные.Представление = "<Все группы>" Тогда
		
		Использование = Ложь;
		
	ИначеЕсли Элементы.ОтборИерархия.ТекущиеДанные.Представление = "<Нет группы>" Тогда
		
		ПравоеЗначение = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
		
	КонецЕсли;
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		ЭтотОбъект.Номенклатура,
		"Родитель",
		ПравоеЗначение,
		Сравнение,
		Представление,
		Использование
	);
	
	ОтборИерархияТекущая = ПравоеЗначение;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)

	Если НоваяСТрока И НЕ Копирование Тогда
		Данные = Элементы.Дерево.ТекущиеДанные;
		Данные.ЭтоГруппа = Истина;
		Данные.Идентификатор = Новый УникальныйИдентификатор;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПослеУдаления(Элемент)

	Если ПоказыватьВыбранные Тогда
		ОбновитьВыбранныеТовары(ПоказыватьВыбранные);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Элемент.ТекущиеДанные.ГруппаКаталога = "" Тогда
		Элемент.ТекущиеДанные.ГруппаКаталога = Элемент.ТекущиеДанные.Идентификатор;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДеревоПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)

	Отказ = Истина;
	Если НЕ Копирование Тогда
		
		ТекСтрока = Элементы.Дерево.ТекущаяСтрока;
		Если ТекСтрока = Неопределено Тогда
			Приемник = ДеревоНаСайте;
		Иначе
			Приемник = ДеревоНаСайте.НайтиПоИдентификатору(ТекСтрока);
			Если НЕ Приемник.ЭтоГруппа Тогда
				Приемник = Приемник.ПолучитьРодителя();
			КонецЕсли;
		КонецЕсли;
		
		НоваяСтрока = Приемник.ПолучитьЭлементы().Добавить();
		НоваяСтрока.ЭтоГруппа = Истина;
		НоваяСтрока.Идентификатор = Новый УникальныйИдентификатор;
		Элемент.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
		Элемент.ИзменитьСтроку();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭлементДеревоПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка = Ложь;
	Если Строка = Неопределено Тогда
		//перетаскивание из других ТЧ - можно
		Возврат;
	КонецЕсли;
	
	НайденнаяСтрока = ДеревоНаСайте.НайтиПоИдентификатору(Строка);
	Если НайденнаяСтрока = Неопределено Тогда
		//Новый элемент - можно
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("Массив") Тогда

		Для каждого стр Из ПараметрыПеретаскивания.Значение Цикл
			Если ТипЗнч(стр) = Тип("СправочникСсылка.Номенклатура") Тогда
				Возврат;
			КонецЕсли;
			Прервать;
		КонецЦикла;
	КонецЕсли;
	
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("ДанныеФормыЭлементДерева") Тогда
		Возврат;
	КонецЕсли;
	
	Если Строка = Неопределено Тогда
		Приемник = ДеревоНаСайте;
	Иначе
		Приемник = ДеревоНаСайте.НайтиПоИдентификатору(Строка);                                                                                                         
		Если НЕ Приемник.ЭтоГруппа Тогда
			Приемник = Приемник.ПолучитьРодителя();
		КонецЕсли;
	КонецЕсли;	
	
	Если НайденнаяСтрока.ПолучитьРодителя() = Приемник Тогда
		//перетаскивание второй номенклатуры в ту же группу
	КонецЕсли;
	
	МассивИДПереносимыхЭлементов = ПараметрыПеретаскивания.Значение;
	ТекущиеЭлементы = ДеревоНаСайте.ПолучитьЭлементы();
	
	Для каждого ИДПереносимыйЭлемент из ПараметрыПеретаскивания.Значение Цикл
		
		ПереносимыйЭлемент = ДеревоНаСайте.НайтиПоИдентификатору(ИДПереносимыйЭлемент);

		Если НЕ ПроверитьВозможностьПереноса(ПереносимыйЭлемент, Приемник) Тогда
			ПараметрыПеретаскивания.Действие=ДействиеПеретаскивания.Отмена;
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЭлементДеревоПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	СтандартнаяОбработка=Ложь;
	
	ИДПриемник = Строка;
	Если ИДПриемник = Неопределено Тогда
		Приемник = ДеревоНаСайте;
	Иначе
		Приемник = ДеревоНаСайте.НайтиПоИдентификатору(ИДПриемник);
		Если НЕ Приемник.ЭтоГруппа Тогда
			Приемник = Приемник.ПолучитьРодителя();
		КонецЕсли;
	КонецЕсли;
	
	МассивИДИсточник = ПараметрыПеретаскивания.Значение;
	
	Если ТипЗнч(ПараметрыПеретаскивания.Значение) = Тип("ДанныеФормыЭлементДерева") Тогда
		
		//перетаскивание из дерева групп
		НоваяСтрока = ПеренестиСПодчиненными(ИДПриемник, МассивИДИсточник.Значение, ДетализацияОтбора);
		
	ИначеЕсли ТипЗнч(МассивИДИсточник) = Тип("Массив") 
		И ТипЗнч(МассивИДИсточник[0]) = Тип("СправочникСсылка.Номенклатура") Тогда
		
		//перетаскивание из списка Номенклатуры
		ДобавитьСтрокиНаСервере(ИДПриемник, МассивИДИсточник);
		
	Иначе
		
		Для Каждого ИДИсточник Из МассивИДИсточник Цикл
			
			Если ТипЗнч(ИДИсточник) = Тип("СправочникСсылка.Номенклатура") Тогда
				// перетаскивание из динамического списка
				Источник = Элементы.Номенклатура.ДанныеСтроки(ИДИсточник);
				НоваяСтрока = СкопироватьСтрокуДерева(Приемник, Источник, Источник.ЭтоГруппа);
			ИначеЕсли ТипЗнч(ИДИсточник) = Тип("ДанныеФормыЭлементДерева") Тогда
				// перетаскивание из дерева групп
				НоваяСтрока = СкопироватьСтрокуДерева(Приемник, ИДИсточник, Истина);			
			Иначе 
				// перетаскивание внутри дерева
				Источник = ДеревоНаСайте.НайтиПоИдентификатору(ИДИсточник);
				Если Приемник = Источник.ПолучитьРодителя() Тогда
					Продолжить;
				КонецЕсли; 
				НоваяСтрока = СкопироватьСтрокуДерева(Приемник, Источник, Источник.ЭтоГруппа);
				
				СтрокаРодитель = Источник.ПолучитьРодителя();
				Если СтрокаРодитель = Неопределено Тогда
					ДеревоНаСайте.ПолучитьЭлементы().Удалить(Источник);
				Иначе
					СтрокаРодитель.ПолучитьЭлементы().Удалить(Источник);
				КонецЕсли;
			КонецЕсли;
			
			Если ИДПриемник = Неопределено И НоваяСтрока <> Неопределено Тогда
				Элементы.Дерево.Развернуть(НоваяСтрока.ПолучитьИдентификатор(), Истина);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если НЕ Приемник = Неопределено И ИДПриемник <> Неопределено Тогда
		Элементы.Дерево.Развернуть(ИДПриемник, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДетализацияОтбораОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	Если ДеревоНаСайте.ПолучитьЭлементы().Количество() > 0 Тогда
	
		ПоказатьВопрос(Новый ОписаниеОповещения("ИзменитьДетализациюРезультат", ЭтотОбъект, ВыбранноеЗначение), 
			НСтр("ru = 'Настройки структуры каталога будут очищены. Продолжить?'"),
			РежимДиалогаВопрос.ОКОтмена);
		
	Иначе
		ИзменитьДетализацию(ВыбранноеЗначение);
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	Закрыть(ЗаписатьИЗакрытьСервер());
	
КонецПроцедуры

&НаКлиенте
Процедура ИерархияВключаяВложенные(Команда)
	
	Элементы.ОтборИерархияКонтекстноеМенюИерархияВключаяВложенные.Пометка = Не Элементы.ОтборИерархияКонтекстноеМенюИерархияВключаяВложенные.Пометка;
	УстановитьОтборПоИерархии();
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьВсе(Команда)
	
	СвернутьДерево(ДеревоНаСайте);
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьВсе(Команда)
	
	РазвернутьДерево(ДеревоНаСайте, 5);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьУровень(Команда)
	
	ТекущийУровень = ПолучитьУровень(ДеревоНаСайте.НайтиПоИдентификатору(Элементы.Дерево.ТекущаяСтрока));
	ПоказатьУровеньДерева(ТекущийУровень);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборВыбранныеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ПоказыватьВыбранные = Истина;
	Если ВыбранноеЗначение = "Выбранные" Тогда
		ОтборВыбранныеНаСервере();
	ИначеЕсли ВыбранноеЗначение = "НеВыбранные" Тогда
		ОтборНЕВыбранныеНаСервере();
	ИначеЕсли ВыбранноеЗначение = "Все" Тогда
		ОтборВсеНаСервере();
	КонецЕсли;
	
	Элементы.Выбран.Видимость = ПоказыватьВыбранные;
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборВыбранныеОчистка(Элемент, СтандартнаяОбработка)
	
	ОтключитьОтборВыбранные();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДеревоИзСохраненныхДанных(ИдентификаторКаталога, АдресНастроекСтруктурыКаталога)
	
	Дерево = РеквизитФормыВЗначение("ДеревоНаСайте");
	
	Если ЗначениеЗаполнено(АдресНастроекСтруктурыКаталога) Тогда
		СохраненныеДанные = ПолучитьИзВременногоХранилища(АдресНастроекСтруктурыКаталога);
	Иначе	
		ТЗ = РегистрыСведений.ОбменССайтомСтруктураКаталога.СоздатьНаборЗаписей();
		ТЗ.Отбор.УзелОбмена.Установить(УзелОбмена);
		ТЗ.Прочитать();
		СохраненныеДанные = ТЗ.Выгрузить();
	КонецЕсли;

	Если СохраненныеДанные <> Неопределено Тогда
	
		ПреобразоватьВДеревоРекурсия(Дерево, СохраненныеДанные);
		ЗначениеВРеквизитФормы(Дерево, "ДеревоНаСайте");
	
	КонецЕсли;
	
КонецПроцедуры
 
 &НаСервере
Процедура ПреобразоватьВДеревоРекурсия(Дерево, тТаблица, Идентификатор = "")
	
	тПоиск = Новый Структура("РодительИдентификатор", Идентификатор);
	тМассив = тТаблица.НайтиСтроки(тПоиск);
	
	Для Каждого стр Из тМассив Цикл
		новаяСтрока = Дерево.Строки.Добавить();
		ЗаполнитьЗначенияСвойств(новаяСтрока, стр);
		Если ЗначениеЗаполнено(стр.РодительКатегория) Тогда
			новаяСтрока.Номенклатура = стр.РодительКатегория;
		КонецЕсли;
		Если НоваяСтрока.ЭтоГруппа Тогда
			НоваяСтрока.Картинка = ?(ЗначениеЗаполнено(новаяСтрока.Номенклатура), 1, 0);
		Иначе
			НоваяСтрока.Картинка = 2;
		КонецЕсли; 

		ПреобразоватьВДеревоРекурсия(новаяСтрока, тТаблица, стр.Идентификатор);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПреобразоватьВТаблицуРекурсия(тДерево, СохраненныеДанные, РодительИдентификатор = "")
	
	Для Каждого стр Из тДерево.Строки Цикл
		новаяСтрока = СохраненныеДанные.Добавить();
		ЗаполнитьЗначенияСвойств(новаяСтрока, стр);
		Если ЗначениеЗаполнено(РодительИдентификатор) Тогда
			новаяСтрока.РодительИдентификатор = стр.Родитель.Идентификатор;
		КонецЕсли;
		Если ТипЗнч(стр.Номенклатура) = Тип("СправочникСсылка.КатегорияНоменклатуры") Тогда
			новаяСтрока.РодительКатегория = стр.Номенклатура;
		ИначеЕсли ТипЗнч(стр.Номенклатура) = Тип("СправочникСсылка.Номенклатура") 
			И стр.ЭтоГруппа Тогда
			новаяСтрока.РодительГруппа = стр.Номенклатура;
		КонецЕсли; 
		
		Если стр.Строки.Количество()>0 Тогда
			ПреобразоватьВТаблицуРекурсия(стр, СохраненныеДанные, новаяСтрока.Идентификатор);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ЗаписатьИЗакрытьСервер()
	
	Дерево = РеквизитФормыВЗначение("ДеревоНаСайте");
		
	ТЗ = РегистрыСведений.ОбменССайтомСтруктураКаталога.СоздатьНаборЗаписей();
	ТЗ.Отбор.УзелОбмена.Установить(УзелОбмена);
	СохраненныеДанные = ТЗ.Выгрузить();
	
	ЕстьНастройки = Дерево.Строки.Количество() > 0;	
	Если ЕстьНастройки Тогда
		ПреобразоватьВТаблицуРекурсия(Дерево, СохраненныеДанные);
	КонецЕсли;
	
	СохраненныеДанные.ЗаполнитьЗначения(УзелОбмена, "УзелОбмена");
	АдресВХранилище = ПоместитьВоВременноеХранилище(СохраненныеДанные, Новый УникальныйИдентификатор);
	
	Возврат Новый Структура("ЕстьНастройки, ДетализацияОтбора, АдресВХранилище", 
		ЕстьНастройки, 
		?(ЕстьНастройки, ДетализацияОтбора, 0),
		АдресВХранилище);
	
КонецФункции

&НаСервере
Процедура ЗаполнитьДеревоИерархии(Группы)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Номенклатура.Ссылка КАК Значение,
	|	Номенклатура.ПометкаУдаления КАК ПометкаУдаленияГруппы,
	|	ВЫБОР
	|		КОГДА Номенклатура.ПометкаУдаления
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Картинка,
	|	Номенклатура.ПометкаУдаления КАК ПометкаУдаления,
	|	Номенклатура.Наименование КАК Представление,
	|	1 КАК Порядок
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ЭтоГруппа
	|	И Номенклатура.Ссылка В ИЕРАРХИИ(&Группы)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Представление ИЕРАРХИЯ";
	
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//"ВЫБРАТЬ
	//|	ИерархияНоменклатуры.Номенклатура КАК Значение,
	//|	ИерархияНоменклатуры.КартинкаГруппы КАК Картинка,
	//|	ИерархияНоменклатуры.ПометкаУдаленияГруппы КАК ПометкаУдаления,
	//|	ИерархияНоменклатуры.Номенклатура.Наименование КАК Представление,
	//|	ИерархияНоменклатуры.Номенклатура.РеквизитДопУпорядочиванияУНФ КАК Порядок
	//|ИЗ
	//|	РегистрСведений.ИерархияНоменклатуры КАК ИерархияНоменклатуры
	//|ГДЕ
	//|	ИерархияНоменклатуры.Номенклатура В ИЕРАРХИИ(&Группы)
	//|
	//|УПОРЯДОЧИТЬ ПО
	//|	Порядок ИЕРАРХИЯ,
	//|	Представление ИЕРАРХИЯ";
	
	Запрос.УстановитьПараметр("Группы", Группы);
	
	Дерево = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	Если Группы.НайтиПоЗначению(Справочники.Номенклатура.ПустаяСсылка()) <> Неопределено Тогда
		СтрокаНетГруппы = Дерево.Строки.Вставить(0);
		СтрокаНетГруппы.Значение	 = Справочники.Номенклатура.ПустаяСсылка();
		СтрокаНетГруппы.Представление= "<Все группы>";
		СтрокаНетГруппы.Картинка = -1;
		
		СтрокаНетГруппы = Дерево.Строки.Добавить();
		СтрокаНетГруппы.Значение	 = Справочники.Номенклатура.ПустаяСсылка();
		СтрокаНетГруппы.Представление= "<Нет группы>";
		СтрокаНетГруппы.Картинка = -1;
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(Дерево,"ОтборИерархия");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДеревоКатегорий(КатегорииСписок)
	
	Дерево = ДеревоКатегорий(КатегорииСписок);
	ЗначениеВРеквизитФормы(Дерево, "ОтборКатегории");
	
КонецПроцедуры

&НаСервере
Функция ДеревоКатегорий(КатегорииСписок) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КатегорииНоменклатуры.Ссылка КАК Значение,
	|	КатегорииНоменклатуры.Наименование КАК Представление
	|ИЗ
	|	Справочник.КатегорииНоменклатуры КАК КатегорииНоменклатуры
	|ГДЕ
	|	КатегорииНоменклатуры.Ссылка В(&КатегорииСписок)
	|	ИЛИ &ВсеКатегории
	|
	|УПОРЯДОЧИТЬ ПО
	|	КатегорииНоменклатуры.ЭтоГруппа ИЕРАРХИЯ,
	|	КатегорииНоменклатуры.РеквизитДопУпорядочивания,
	|	КатегорииНоменклатуры.Наименование";
	Запрос.УстановитьПараметр("КатегорииСписок", КатегорииСписок);
	Запрос.УстановитьПараметр("ВсеКатегории", КатегорииСписок.НайтиПоЗначению(Справочники.КатегорииНоменклатуры.ПустаяСсылка()) <> Неопределено);
	
	Дерево = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	Если Дерево.Строки.Количество() > 1 Тогда
		
		СтрокаНетКатегории = Дерево.Строки.Вставить(0);
		СтрокаНетКатегории.Значение = Справочники.Номенклатура.ПустаяСсылка();
		СтрокаНетКатегории.Представление = НСтр("ru='<Все категории>'");
		
	КонецЕсли;
	
	Возврат Дерево;
	
КонецФункции

&НаСервере
Функция ИдентификаторСтрокиДереваПоЗначению(Коллекция, ИскомоеЗначение)
	
	КоллекцияЭлементов = Коллекция.ПолучитьЭлементы();
	
	Для каждого Элемент Из КоллекцияЭлементов Цикл
		
		Если Элемент.Значение = ИскомоеЗначение Тогда
			Возврат Элемент.ПолучитьИдентификатор();
		КонецЕсли;
		
		Идентификатор = ИдентификаторСтрокиДереваПоЗначению(Элемент, ИскомоеЗначение);
		
		Если Идентификатор <> Неопределено Тогда
			Возврат Идентификатор;
		КонецЕсли;
		
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Процедура ОтборКатегорииПриАктивизацииСтрокиНаКлиенте()
	
	Если ОтборКатегорииИерархия = ПредопределенноеЗначение("Перечисление.ВидыОтборовНоменклатуры.ГруппыНоменклатуры") Тогда
		
		ОтборКатегорииТекущая = ПредопределенноеЗначение("Справочник.КатегорииНоменклатуры.ПустаяСсылка");
		
	ИначеЕсли ОтборКатегорииИерархия = ПредопределенноеЗначение("Перечисление.ВидыОтборовНоменклатуры.КатегорииНоменклатуры") Тогда
		
		Если Элементы.ОтборКатегории.ТекущиеДанные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
		ОтборКатегорииТекущая = Элементы.ОтборКатегории.ТекущиеДанные.Значение;
		
	КонецЕсли;
	
	ОтборКатегорииПриАктивизацииСтрокиНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ОтборКатегорииПриАктивизацииСтрокиНаСервере()
	
	УстановитьОтборПоКатегории(
		ЭтотОбъект,
		Номенклатура, 
		ОтборКатегорииТекущая
	);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтборПоКатегории(Форма, Список, ВыбраннаяКатегория) Экспорт
	
	УдалитьОтборыСвойствПредыдущейКатегории(Форма, Список);
	
	Если НЕ ЗначениеЗаполнено(ВыбраннаяКатегория) Тогда
		
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(
			Список.КомпоновщикНастроек.Настройки.Отбор,,
			"ОтборПоКатегории");
		Возврат;
		
	КонецЕсли;
	
	ГруппаОтборПоКатегории = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
		Список.КомпоновщикНастроек.Настройки.Отбор.Элементы,
		"ОтборПоКатегории",
		ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИли);
		
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
		ГруппаОтборПоКатегории,
		"КатегорияНоменклатуры",
		ВидСравненияКомпоновкиДанных.Равно,
		ВыбраннаяКатегория,
		"ОтборПоКатегории",
		ЗначениеЗаполнено(ВыбраннаяКатегория));
	
	ОбщегоНазначенияКлиентСервер.ДобавитьЭлементКомпоновки(
		ГруппаОтборПоКатегории,
		"КатегорияНоменклатуры",
		ВидСравненияКомпоновкиДанных.ВИерархии,
		ВыбраннаяКатегория,
		"ОтборПоКатегорииВИерархии",
		ЗначениеЗаполнено(ВыбраннаяКатегория));
	
КонецПроцедуры

&НаСервере
Процедура УдалитьОтборыСвойствПредыдущейКатегории(Форма, Список)
	
	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(
		Список.КомпоновщикНастроек.Настройки.Отбор,,
		"ОтборПоСвойствамВыбраннойКатегории");
			
	ДанныеМеток = Форма.ДанныеМеток.Выгрузить(, "ИмяПоляОтбора");
	ДанныеМеток.Свернуть("ИмяПоляОтбора");
	Для каждого Метка Из ДанныеМеток Цикл
		
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбора(
			Список.КомпоновщикНастроек.Настройки.Отбор,
			Метка.ИмяПоляОтбора);
		
	КонецЦикла;
	
	Форма.ДанныеМеток.Очистить();
	
КонецПроцедуры

&НаСервере
Функция ИдентификаторВСтроке(СтрокаДерева)
	
	Если НЕ ЗначениеЗаполнено(СтрокаДерева.Номенклатура) Тогда
		Возврат Новый УникальныйИдентификатор;
	КонецЕсли;
	
	ТекИдентификатор = СтрокаДерева.Номенклатура.УникальныйИдентификатор();
	Если НЕ СтрокаДерева.ЭтоГруппа Тогда
		СтрокаДерева.Картинка = 2;
		Возврат ТекИдентификатор;
	КонецЕсли;
	
	Дерево = РеквизитФормыВЗначение("ДеревоНаСайте");
	ОтборИдентификатор = Новый Структура("Идентификатор, ЭтоГруппа", Строка(ТекИдентификатор), Истина);
	СтрокиДерева = Дерево.Строки.НайтиСтроки(ОтборИдентификатор, Истина);
	Если СтрокиДерева.Количество() > 0 Тогда
		//эта группа уже добавлена
		СтрокаДерева.Картинка = 0; //добавленная вручную группа
		СтрокаДерева.Номенклатура = Неопределено;
		Возврат Новый УникальныйИдентификатор;
	Иначе
		СтрокаДерева.Картинка = 1; //перенесенная группа
		Возврат ТекИдентификатор;
	КонецЕсли; 
	
КонецФункции

&НаКлиенте
Функция ПроверитьВозможностьПереноса(ПереносимыйЭлемент, Знач НовыйРодитель)
	
	Пока НЕ НовыйРодитель = Неопределено Цикл
		Если ПереносимыйЭлемент = НовыйРодитель Тогда
			Возврат Ложь;
		КонецЕсли;
		НовыйРодитель = НовыйРодитель.ПолучитьРодителя();
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Функция СкопироватьСтрокуДерева(Приемник, Источник, ЭтоГруппа = Ложь)
	
	Перем НоваяСтрока, ОбратныйИндекс, КолПодчиненныхСтрок;
	
	Если Источник = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ТипЗнч(Источник) = Тип("ДанныеФормыДерево") Тогда
		
		Для каждого элДерева Из Источник.ПолучитьЭлементы() Цикл
			СкопироватьСтрокуДерева(Приемник, элДерева, Истина);
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДанныеФормыКоллекцияЭлементовДерева") Тогда
		
		Для каждого элДерева Из Источник Цикл
			СкопироватьСтрокуДерева(Приемник, элДерева, элДерева.ПолучитьЭлементы().Количество() > 0);
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(Источник) = Тип("ДанныеФормыЭлементДерева") Тогда
		
		НоваяСтрока = Приемник.ПолучитьЭлементы().Добавить();
		НоваяСтрока.Номенклатура = Источник.Номенклатура;
		Если Источник.Свойство("ГруппаКаталога") Тогда
			Если Источник.ГруппаКаталога="" Тогда
				НоваяСтрока.ГруппаКаталога = Источник.Идентификатор;
			Иначе
				НоваяСтрока.ГруппаКаталога = Источник.ГруппаКаталога;
			КонецЕсли;
		Иначе
			НоваяСтрока.ГруппаКаталога = Источник.Номенклатура;	
		КонецЕсли;
		
		Если Источник.Свойство("ЭтоГруппа") Тогда
			НоваяСтрока.ЭтоГруппа = Источник.ЭтоГруппа;
			НоваяСтрока.Картинка = Источник.Картинка;
		Иначе
			НоваяСтрока.ЭтоГруппа = ЭтоГруппа;
			НоваяСтрока.Картинка = ?(ЭтоГруппа, 1, 2);
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(НоваяСтрока.Номенклатура) Тогда
		    НоваяСтрока.Идентификатор = НоваяСтрока.Номенклатура.УникальныйИдентификатор();
		Иначе 
			НоваяСтрока.Идентификатор = Источник.Идентификатор;
		КонецЕсли;
		Если ТипЗнч(Приемник) = Тип("ДанныеФормыЭлементДерева") Тогда
			НоваяСтрока.РодительИдентификатор = Приемник.Идентификатор;
		КонецЕсли; 
		
		Если Источник.ПолучитьЭлементы().Количество() > 0 Тогда
			СкопироватьСтрокуДерева(НоваяСтрока, Источник.ПолучитьЭлементы());
		КонецЕсли;
	КонецЕсли;
	
	Возврат НоваяСтрока;
	
КонецФункции

&НаСервере
Процедура ДобавитьСтрокиНаСервере(ИДПриемник, ИсточникМассив)

	Если ДетализацияОтбора = 2 Тогда
		//перетаскиваем только группы
		Для каждого стр Из ИсточникМассив Цикл
			Если ТипЗнч(стр) = Тип("СправочникСсылка.Номенклатура") И НЕ стр.ЭтоГруппа Тогда
				Возврат;
			КонецЕсли;
			
			Прервать;
		КонецЦикла;
	КонецЕсли;
	
	Если ИДПриемник = Неопределено Тогда
		Приемник = ДеревоНаСайте;
	Иначе
		Приемник = ДеревоНаСайте.НайтиПоИдентификатору(ИДПриемник);
		Если НЕ Приемник.ЭтоГруппа Тогда
			//перетаскивание на элемент (не группу)
			Приемник = Приемник.ПолучитьРодителя();
		КонецЕсли;
	КонецЕсли;
	
	ЭлементыВГруппе = Приемник.ПолучитьЭлементы();
	
	Для каждого Источник Из ИсточникМассив Цикл
		
		НоваяСтрока = ЭлементыВГруппе.Добавить();
		НоваяСтрока.ГруппаКаталога = Источник.Наименование;
		НоваяСтрока.ЭтоГруппа = Источник.ЭтоГруппа;
		НоваяСтрока.Номенклатура = Источник.Ссылка;
		
		НоваяСтрока.Идентификатор = ИдентификаторВСтроке(НоваяСтрока);		
		
		ТекущийРодитель = НоваяСтрока.ПолучитьРодителя();
		Если ТекущийРодитель <> Неопределено Тогда
			 НоваяСтрока.РодительИдентификатор = ТекущийРодитель.Идентификатор;
		КонецЕсли;

	КонецЦикла;
	
	Если ПоказыватьВыбранные Тогда
		ОбновитьВыбранныеТовары(ПоказыватьВыбранные);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ДобавитьНоменклатуруРекурсивно(Приемник, ИсточникМассив)

	Для каждого Источник Из ИсточникМассив Цикл
	
		НоваяСтрока = Приемник.ПолучитьЭлементы().Добавить();
		НоваяСтрока.ГруппаКаталога = Источник.Наименование;
		НоваяСтрока.ЭтоГруппа = Источник.ЭтоГруппа;

		НоваяСтрока.Номенклатура = Источник.Ссылка;
		НоваяСтрока.Идентификатор = ИдентификаторВСтроке(НоваяСтрока);
		
		ТекущийРодитель = НоваяСтрока.ПолучитьРодителя();
		Если ТекущийРодитель <> Неопределено Тогда
			 НоваяСтрока.РодительИдентификатор = ТекущийРодитель.Идентификатор;
		КонецЕсли;
		
		Если Источник.Строки.Количество() > 0 Тогда
			ДобавитьНоменклатуруРекурсивно(НоваяСтрока, Источник.Строки);
		КонецЕсли;
		
	КонецЦикла;
	
	Если ПоказыватьВыбранные Тогда
		ОбновитьВыбранныеТовары(ПоказыватьВыбранные);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ДобавитьКатегориюРекурсивно(Приемник, ИсточникМассив)

	Для каждого Источник Из ИсточникМассив Цикл
	
		НоваяСтрока = Приемник.ПолучитьЭлементы().Добавить();
		
		Если НЕ ЗначениеЗаполнено(Источник.Ссылка) Тогда
			НоваяСтрока.Номенклатура = Источник.Категория;
			НоваяСтрока.ЭтоГруппа = Истина;
			НоваяСтрока.ГруппаКаталога = Источник.Категория;
		Иначе
			НоваяСтрока.Номенклатура = Источник.Ссылка;
			НоваяСтрока.ЭтоГруппа = Источник.ЭтоГруппа;
			НоваяСтрока.ГруппаКаталога = Источник.Ссылка;
		КонецЕсли;
	    НоваяСтрока.Идентификатор = ИдентификаторВСтроке(НоваяСтрока);
		
		Если Источник.Строки.Количество() > 0 Тогда
			ДобавитьКатегориюРекурсивно(НоваяСтрока, Источник.Строки);
		КонецЕсли;
		
	КонецЦикла;
	
	Если ПоказыватьВыбранные Тогда
		ОбновитьВыбранныеТовары(ПоказыватьВыбранные);
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПеренестиСПодчиненными(ИДПриемник, Источник, ДетализацияОтбора)
	
	Если ЗначениеЗаполнено(ИДПриемник) Тогда
		Приемник = ДеревоНаСайте.НайтиПоИдентификатору(ИДПриемник);
	Иначе
		Приемник = ДеревоНаСайте;
	КонецЕсли; 
	
	Если ТипЗнч(Источник) = Тип("СправочникСсылка.Номенклатура") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка,
		|	Номенклатура.Наименование КАК Наименование,
		|	Номенклатура.ЭтоГруппа КАК ЭтоГруппа,
		|	Номенклатура.Родитель КАК Родитель
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В ИЕРАРХИИ(&Источник)
		|	И (Номенклатура.ЭтоГруппа ИЛИ НЕ &ТолькоГруппы)
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура.Ссылка ИЕРАРХИЯ";
		Запрос.УстановитьПараметр("Источник", Источник);
		Запрос.УстановитьПараметр("ТолькоГруппы", ДетализацияОтбора = 2);
		
		Результат = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		ДобавитьНоменклатуруРекурсивно(Приемник, Результат.Строки);
		
	ИначеЕсли ДетализацияОтбора = 2 Тогда
		//одна категория без подчиненных товаров
		
		НоваяСтрока = Приемник.ПолучитьЭлементы().Добавить();
		НоваяСтрока.Номенклатура = Источник;
		НоваяСтрока.ЭтоГруппа = Истина;
		НоваяСтрока.ГруппаКаталога = Источник;
	    НоваяСтрока.Идентификатор = ИдентификаторВСтроке(НоваяСтрока);
		
		Если ПоказыватьВыбранные Тогда
			ОбновитьВыбранныеТовары(ПоказыватьВыбранные);
		КонецЕсли;
		
	Иначе
		//категория с подчиненными товарами
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка,
		|	Номенклатура.Наименование КАК Наименование,
		|	Номенклатура.ЭтоГруппа КАК ЭтоГруппа,
		|	Номенклатура.КатегорияНоменклатуры КАК Категория
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.КатегорияНоменклатуры В ИЕРАРХИИ(&Источник)
		|ИТОГИ ПО
		|	Категория";
		Запрос.УстановитьПараметр("Источник", Источник);
		
		Результат = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
		ДобавитьКатегориюРекурсивно(Приемник, Результат.Строки);
		
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Функция ПолучитьУровень(ТекущаяСтрока, ТекУровень = 0)
	
	РодительВИерархии = ТекущаяСтрока.ПолучитьРодителя();
	Если РодительВИерархии <> Неопределено Тогда
		ТекУровень = ТекУровень + 1;
		ПолучитьУровень(РодительВИерархии, ТекУровень);
	Иначе
		Возврат ТекУровень;
	КонецЕсли;
	
	Возврат ТекУровень;
	
КонецФункции

&НаКлиенте
Процедура ПоказатьУровеньДерева(Уровень)
	
	СвернутьДерево(ДеревоНаСайте);
	РазвернутьДерево(ДеревоНаСайте, Уровень);
	
КонецПроцедуры

&НаКлиенте
Процедура СвернутьДерево(Дерево)
	
	Для Каждого Строка Из Дерево.ПолучитьЭлементы() Цикл
		ИдентификаторСтроки=Строка.ПолучитьИдентификатор();
		СвернутьДерево(Строка);
		
		Элементы.Дерево.Свернуть(ИдентификаторСтроки);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РазвернутьДерево(Дерево, знач Уровень)
	
	Уровень=Уровень-1;
	Для Каждого Строка Из Дерево.ПолучитьЭлементы() Цикл
		
		Если Уровень>=0 Тогда
			ИдентификаторСтроки=Строка.ПолучитьИдентификатор();
			Элементы.Дерево.Развернуть(ИдентификаторСтроки);

			РазвернутьДерево(Строка, Уровень);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВыбранныеТовары(Показывать)

	МассивОтбор = Новый Массив;
	Если Показывать Тогда
		Дерево = РеквизитФормыВЗначение("ДеревоНаСайте");
		ОбойтиДеревоРекурсивноНаСервере(Дерево, МассивОтбор);
	КонецЕсли; 
	
	Номенклатура.Параметры.УстановитьЗначениеПараметра("Выбранные", МассивОтбор);
	
КонецПроцедуры

&НаСервере
Процедура ОбойтиДеревоРекурсивноНаСервере(ДеревоЗначений, МассивОтбор)
	Для Каждого СтрокаДерева Из ДеревоЗначений.Строки Цикл
        МассивОтбор.Добавить(СтрокаДерева.Номенклатура);
         
        Если СтрокаДерева.Строки.Количество() > 0 Тогда
           ОбойтиДеревоРекурсивноНаСервере(СтрокаДерева, МассивОтбор);
        КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ОтборВыбранныеНаСервере()
	
	ОбновитьВыбранныеТовары(Истина);
	ОбщийМодульКлиентСервер.УстановитьЭлементОтбораСписка(Номенклатура, "Выбран", Истина, Истина, ВидСравненияКомпоновкиДанных.Равно);
	
КонецПроцедуры

&НаСервере
Процедура ОтборНЕВыбранныеНаСервере()
	
	ОбновитьВыбранныеТовары(Истина);
	ОбщийМодульКлиентСервер.УстановитьЭлементОтбораСписка(Номенклатура, "Выбран", Ложь, Истина, ВидСравненияКомпоновкиДанных.Равно);
	
КонецПроцедуры

&НаСервере
Процедура ОтборВсеНаСервере()
	
	ОбновитьВыбранныеТовары(Истина);
	ОбщийМодульКлиентСервер.УстановитьЭлементОтбораСписка(Номенклатура, "Выбран", Истина, Ложь, ВидСравненияКомпоновкиДанных.Равно);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтключитьОтборВыбранные()
	
	ОтборВыбранные = "";
	ПоказыватьВыбранные = Ложь;
	Элементы.Выбран.Видимость = Ложь;
	ОбновитьВыбранныеТовары(Ложь);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьДетализацию(Детализация) Экспорт
		
	Модифицированность = Истина;
	ДетализацияОтбора = Детализация;
	Элементы.НоменклатураОтбор.Доступность = (ДетализацияОтбора = 1);
	ДеревоНаСайте.ПолучитьЭлементы().Очистить();
	
	ОтключитьОтборВыбранные();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьДетализациюРезультат(Результат, ДополнительныеПараметры) Экспорт
		
	Если Результат = КодВозвратаДиалога.ОК Тогда
		
		ИзменитьДетализацию(ДополнительныеПараметры);

	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
